<a href="https://colab.research.google.com/github/a-forty-two/COG_GN22CDBDS001_MARCH_22/blob/main/MORE_PANDAS_Auto_MPG.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [15]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

In [ ]:
# https://raw.githubusercontent.com/a-forty-two/COG_GN22CDBDS001_MARCH_22/main/cars1.csv
# https://raw.githubusercontent.com/a-forty-two/COG_GN22CDBDS001_MARCH_22/main/cars2.csv

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1=pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv')
cars2=pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv')

In [3]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [4]:
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [6]:
cars1=cars1.iloc[:,0:9]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [8]:
len(cars1)

198

In [9]:
len(cars2)

200

In [10]:
cars1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 198 entries, 0 to 197
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           198 non-null    float64
 1   cylinders     198 non-null    int64
 2   displacement  198 non-null    int64
 3   horsepower    198 non-null    object
 4   weight        198 non-null    int64
 5   acceleration  198 non-null    float64
 6   model         198 non-null    int64
 7   origin        198 non-null    int64
 8   car           198 non-null    object
dtypes: float64(2), int64(5), object(2)
memory usage: 14.0+ KB

In [11]:
cars2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           200 non-null    float64
 1   cylinders     200 non-null    int64
 2   displacement  200 non-null    int64
 3   horsepower    200 non-null    object
 4   weight        200 non-null    int64
 5   acceleration  200 non-null    float64
 6   model         200 non-null    int64
 7   origin        200 non-null    int64
 8   car           200 non-null    object
dtypes: float64(2), int64(5), object(2)
memory usage: 14.2+ KB

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [13]:
cars=pd.concat([cars1,cars2]) #hence we use concat function to combine 
cars.head()                    #both dataframes

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

In [14]:
cars.info()  #checking the number of rows should ne now car1+cars2

<class 'pandas.core.frame.DataFrame'>
Int64Index: 398 entries, 0 to 199
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    int64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model         398 non-null    int64
 7   origin        398 non-null    int64
 8   car           398 non-null    object
dtypes: float64(2), int64(5), object(2)
memory usage: 31.1+ KB

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [19]:
own=np.random.randint(15000,73000,size=398) #size should the equivalent to
own                                         #the total rows in cars

array([19980, 42120, 31210, 24771, 30139, 44611, 44793, 35626, 17446,
       59593, 26828, 36799, 61088, 25895, 66244, 35395, 23192, 63792,
       23547, 53170, 46923, 72667, 60259, 52390, 36753, 60354, 67314,
       19884, 34854, 62876, 22949, 70318, 41958, 32772, 18971, 65863,
       49711, 34622, 38061, 59263, 17889, 62229, 28719, 55935, 54842,
       35164, 22072, 35478, 64764, 24807, 31539, 30795, 18091, 60607,
       69835, 69434, 19861, 41071, 50702, 54428, 68434, 49391, 15138,
       19729, 39062, 57561, 37511, 71394, 18655, 29762, 16380, 63521,
       59231, 42887, 69435, 53503, 37970, 59659, 68607, 25080, 54330,
       32902, 17335, 60782, 56186, 44155, 69850, 19151, 43011, 24080,
       66708, 33897, 48336, 39643, 50963, 59750, 47594, 41299, 31996,
       37251, 24014, 59995, 71528, 35489, 42194, 67834, 52148, 22524,
       66132, 34983, 69256, 41733, 72161, 47530, 18789, 58275, 18662,
       33447, 50503, 46801, 55752, 32655, 63834, 71050, 15646, 42198,
       62420, 24628, 15020, 30666, 15141, 65610, 53296, 28076, 51856,
       30593, 67433, 42660, 62102, 32409, 64595, 36421, 52554, 28682,
       22257, 36260, 33304, 50397, 28365, 19897, 39374, 58541, 55862,
       57656, 28480, 66911, 26549, 31339, 16273, 55577, 29468, 17856,
       46226, 51927, 51693, 16726, 61529, 52601, 44555, 51989, 68661,
       66699, 15249, 60864, 45245, 34155, 62453, 31879, 48687, 21640,
       34446, 72702, 57394, 54590, 33174, 15579, 43541, 33234, 39616,
       36388, 33944, 25923, 34870, 67916, 34752, 29343, 42612, 18040,
       72538, 49271, 39104, 21366, 60960, 24413, 27684, 59500, 20790,
       40545, 18610, 20236, 62141, 67466, 36806, 24998, 34188, 68139,
       36884, 61375, 20310, 19414, 44972, 59889, 24690, 71374, 70356,
       66795, 48146, 69286, 17900, 62321, 53592, 46019, 29046, 62421,
       65195, 23941, 29944, 70068, 26940, 59143, 52402, 72741, 69809,
       32725, 43248, 31191, 27236, 31681, 33104, 21892, 69856, 55537,
       50380, 51454, 71102, 25894, 72783, 37054, 59874, 20346, 44337,
       62088, 31372, 55011, 59644, 17778, 15976, 55301, 66613, 29398,
       22100, 32421, 48014, 32337, 25407, 56528, 42446, 28832, 55787,
       72562, 26727, 38696, 57909, 15896, 20972, 19498, 62687, 58620,
       23924, 72035, 65228, 62694, 68886, 58541, 17924, 25179, 59616,
       29612, 28938, 21656, 19982, 37531, 63313, 48014, 43696, 47172,
       31006, 38249, 26220, 25581, 33093, 68992, 36000, 26441, 31180,
       66252, 54568, 67748, 51689, 48259, 42440, 69969, 71264, 49440,
       24013, 38013, 25425, 21667, 18462, 35486, 23460, 30131, 24201,
       23611, 31372, 56767, 61985, 21170, 16354, 31743, 37956, 70146,
       52522, 62976, 58640, 57063, 44527, 18741, 42628, 19043, 19296,
       54718, 44221, 57109, 64387, 37243, 45717, 71749, 57547, 16317,
       22212, 62957, 56518, 52475, 19045, 56464, 66223, 15647, 15042,
       16955, 72729, 48830, 28311, 17645, 40045, 42944, 40774, 59091,
       48367, 41621, 69928, 35103, 60742, 55836, 48810, 28820, 32403,
       46754, 59633, 34121, 42874, 48461, 17864, 37929, 68401, 67456,
       60900, 31508])

### Step 8. Add the column owners to cars